In [22]:
import numpy as np
import pandas as pd

In [23]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [24]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [25]:
df.head()

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [26]:
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [27]:
df["Column2"].nunique()

3

In [28]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [29]:
df[(df["Column1"] > 2) & (df["Column2"] == 300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [30]:
def times3(x):
    return x * 3

In [31]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [32]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [33]:
df["Column2"].apply(lambda x : x *2 )

0    200
1    200
2    400
3    600
4    600
5    200
Name: Column2, dtype: int64

In [35]:
df.drop("Column1",axis = 1,inplace = True)

In [36]:
df

   Column2  Column3
0      100  Mustafa
1      100    Kamil
2      200     Emre
3      300     Ayşe
4      300    Murat
5      100   Zeynep

In [37]:
df.columns

Index(['Column2', 'Column3'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
df.index.names

FrozenList([None])

In [41]:
len(df.index)

6

In [42]:
df

   Column2  Column3
0      100  Mustafa
1      100    Kamil
2      200     Emre
3      300     Ayşe
4      300    Murat
5      100   Zeynep

In [45]:
df.sort_values("Column2")

   Column2  Column3
0      100  Mustafa
1      100    Kamil
5      100   Zeynep
2      200     Emre
3      300     Ayşe
4      300    Murat

In [47]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [48]:
df

      Ay  Nem     Şehir
0   Mart   10    Ankara
1  Nisan   25    Ankara
2  Mayıs   50    Ankara
3   Mart   21  İstanbul
4  Nisan   67  İstanbul
5  Mayıs   80  İstanbul
6   Mart   30     İzmir
7  Nisan   70     İzmir
8  Mayıs   75     İzmir

In [50]:
df.pivot_table(index = "Şehir",columns ="Ay",values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [51]:
df.pivot_table(index = "Ay",columns ="Şehir",values = "Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [52]:
df

      Ay  Nem     Şehir
0   Mart   10    Ankara
1  Nisan   25    Ankara
2  Mayıs   50    Ankara
3   Mart   21  İstanbul
4  Nisan   67  İstanbul
5  Mayıs   80  İstanbul
6   Mart   30     İzmir
7  Nisan   70     İzmir
8  Mayıs   75     İzmir